const express = require("express");
const hbs = require("hbs")
const app = express();

app.set("view engine", "hbs"); //Поставить определенный движок
app.set("views", "./templates"); //Размещение шаблонов

app.use('/static', express.static('static'));
let data = {
            "name":"Максим",
            "surname":"Губанов",
            "age":"15",
            "height":"184см",
            "img":"/static/views/1.jpg",
            "title":"My page",
            "list": ["Булочка с корицей", "1060", "3070", "миллиард денЯг", "Pixel 6"],
            "keys":{
                "Название":"Fable",
                "Жанр":"Фэнтези, приключения",
                "Платформа":"PC"
            },
            "chapters":{
                "Соня Блэйд": {
                    "Картинка":"/static/views/1.jpg",
                    "Имя":"Соня Блэйд",
                    "Регион":"1111",
                    "Описание":"111111"
                },
                "Китана": {
                    "Картинка":"/static/views/2.jpg",
                    "Имя":"Китана",
                    "Регион":"2222",
                    "Описание":"2222"
                },
                "Джакс": {
                    "Картинка":"/static/views/3.jpg",
                    "Имя":"Джакс",
                    "Регион":"3333",
                    "Описание":"3333"
                },
                "Кто-то": {
                    "Картинка":"/static/views/4.jpg",
                    "Имя":"Кто-то",
                    "Регион":"4444",
                    "Описание":"4444"
                },
                "Кабал": {
                    "Картинка":"/static/views/5.jpg",
                    "Имя":"Кабал",
                    "Регион":"5555",
                    "Описание":"5555"
                },
                "Шао Кан": {
                    "Картинка":"/static/views/6.jpg",
                    "Имя":"Шао Кан",
                    "Регион":"6666",
                    "Описание":"6666"
                },
                "Эрон БЛЭК": {
                    "Картинка":"/static/views/7.jpg",
                    "Имя":"Эрон БЛЭК",
                    "Регион":"7777",
                    "Описание":"7777"
                },
                "HERE'S DJONII": {
                    "Картинка":"/static/views/8.jpg",
                    "Имя":"",
                    "Регион":"8888",
                    "Описание":"8888"
                },
                "Барака": {
                    "Картинка":"/static/views/9.jpg",
                    "Имя":"Барака",
                    "Регион":"9999",
                    "Описание":"9999"
                },
                "Нуб сайбот": {
                    "Картинка":"/static/views/10.jpg",
                    "Имя":"Нуб сайбот",
                    "Регион":"10101010",
                    "Описание":"10101010"
                }
            }
        };
app.get("/", function(req, res) {
    res.render("index.hbs", data);
    //на странице были элементы шаблона, которые вписывают фамилию, возраст и рост человека. Эти данные нужно передавать с сервера в шаблон.
});

app.listen(3000, function() {
    console.log("Сервер запущен");
});